OpenFOAM-v2506/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 10.1233;

boundaryField
{
    "p[0-9]+"
    {
        type            zeroGradient;
    }

    terrain
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    top
    {
        type            fixedValue;
        value           uniform 10.123;
    }
}


// ************************************************************************* //
